results_laptop/node_exporter/results/parallel_wrk/output_128.txt
stdout:
--------------------------------------------------------
Running benchmark with 1 threads and 1 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.08us   89.87us   2.70ms   97.90%
    Req/Sec    46.65k     4.85k   57.43k    73.00%
  927647 requests in 20.00s, 0.93GB read
Requests/sec:  46381.67
Transfer/sec:     47.68MB
--------------------------------------------------------
Running benchmark with 2 threads and 1 connections for 20s
Usage: wrk <options> <url>                            
  Options:                                            
    -c, --connections <N>  Connections to keep open   
    -d, --duration    <T>  Duration of test           
    -t, --threads     <N>  Number of threads to use   
                                                      
    -s, --script      <S>  Load Lua script file       
    -H, --header      <H>  Add header to request      
        --latency          Print latency statistics   
        --timeout     <T>  Socket/request timeout     
    -v, --version          Print version details      
                                                      
  Numeric arguments may include a SI unit (1k, 1M, 1G)
  Time arguments may include a time unit (2s, 2m, 2h)
--------------------------------------------------------
Running benchmark with 4 threads and 1 connections for 20s
Usage: wrk <options> <url>                            
  Options:                                            
    -c, --connections <N>  Connections to keep open   
    -d, --duration    <T>  Duration of test           
    -t, --threads     <N>  Number of threads to use   
                                                      
    -s, --script      <S>  Load Lua script file       
    -H, --header      <H>  Add header to request      
        --latency          Print latency statistics   
        --timeout     <T>  Socket/request timeout     
    -v, --version          Print version details      
                                                      
  Numeric arguments may include a SI unit (1k, 1M, 1G)
  Time arguments may include a time unit (2s, 2m, 2h)
--------------------------------------------------------
Running benchmark with 8 threads and 1 connections for 20s
Usage: wrk <options> <url>                            
  Options:                                            
    -c, --connections <N>  Connections to keep open   
    -d, --duration    <T>  Duration of test           
    -t, --threads     <N>  Number of threads to use   
                                                      
    -s, --script      <S>  Load Lua script file       
    -H, --header      <H>  Add header to request      
        --latency          Print latency statistics   
        --timeout     <T>  Socket/request timeout     
    -v, --version          Print version details      
                                                      
  Numeric arguments may include a SI unit (1k, 1M, 1G)
  Time arguments may include a time unit (2s, 2m, 2h)
--------------------------------------------------------
Running benchmark with 16 threads and 1 connections for 20s
Usage: wrk <options> <url>                            
  Options:                                            
    -c, --connections <N>  Connections to keep open   
    -d, --duration    <T>  Duration of test           
    -t, --threads     <N>  Number of threads to use   
                                                      
    -s, --script      <S>  Load Lua script file       
    -H, --header      <H>  Add header to request      
        --latency          Print latency statistics   
        --timeout     <T>  Socket/request timeout     
    -v, --version          Print version details      
                                                      
  Numeric arguments may include a SI unit (1k, 1M, 1G)
  Time arguments may include a time unit (2s, 2m, 2h)
--------------------------------------------------------
Running benchmark with 1 threads and 10 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    86.59us  152.82us   2.06ms   94.53%
    Req/Sec   135.77k    29.64k  184.47k    70.00%
  2700702 requests in 20.00s, 2.71GB read
Requests/sec: 135032.41
Transfer/sec:    138.82MB
--------------------------------------------------------
Running benchmark with 2 threads and 10 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   114.59us  189.03us   6.51ms   93.45%
    Req/Sec    60.39k    10.01k   98.42k    91.50%
  2403095 requests in 20.00s, 2.41GB read
Requests/sec: 120140.51
Transfer/sec:    123.51MB
--------------------------------------------------------
Running benchmark with 4 threads and 10 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.75us  178.36us   9.11ms   95.39%
    Req/Sec    29.39k     5.05k   47.76k    91.25%
  2339360 requests in 20.00s, 2.35GB read
Requests/sec: 116952.92
Transfer/sec:    120.23MB
--------------------------------------------------------
Running benchmark with 8 threads and 10 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   100.32us  210.10us  10.64ms   95.62%
    Req/Sec    14.22k     2.36k   23.59k    89.69%
  2263540 requests in 20.01s, 2.27GB read
Requests/sec: 113118.46
Transfer/sec:    116.29MB
--------------------------------------------------------
Running benchmark with 16 threads and 10 connections for 20s
Usage: wrk <options> <url>                            
  Options:                                            
    -c, --connections <N>  Connections to keep open   
    -d, --duration    <T>  Duration of test           
    -t, --threads     <N>  Number of threads to use   
                                                      
    -s, --script      <S>  Load Lua script file       
    -H, --header      <H>  Add header to request      
        --latency          Print latency statistics   
        --timeout     <T>  Socket/request timeout     
    -v, --version          Print version details      
                                                      
  Numeric arguments may include a SI unit (1k, 1M, 1G)
  Time arguments may include a time unit (2s, 2m, 2h)
--------------------------------------------------------
Running benchmark with 1 threads and 25 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   166.79us  206.21us   4.72ms   92.11%
    Req/Sec   122.97k    23.17k  182.24k    85.00%
  2446471 requests in 20.00s, 2.46GB read
Requests/sec: 122313.55
Transfer/sec:    125.75MB
--------------------------------------------------------
Running benchmark with 2 threads and 25 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   246.01us  281.07us   4.86ms   89.22%
    Req/Sec    52.56k     8.90k   88.38k    91.25%
  2091979 requests in 20.00s, 2.10GB read
Requests/sec: 104582.18
Transfer/sec:    107.52MB
--------------------------------------------------------
Running benchmark with 4 threads and 25 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   257.52us  283.48us   6.68ms   89.28%
    Req/Sec    25.85k     5.27k  105.09k    90.76%
  2059901 requests in 20.10s, 2.07GB read
Requests/sec: 102482.48
Transfer/sec:    105.36MB
--------------------------------------------------------
Running benchmark with 8 threads and 25 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   290.19us  321.61us  13.38ms   89.11%
    Req/Sec    12.07k     2.72k   55.78k    89.39%
  1924359 requests in 20.10s, 1.93GB read
Requests/sec:  95743.08
Transfer/sec:     98.43MB
--------------------------------------------------------
Running benchmark with 16 threads and 25 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   210.66us  298.52us  11.44ms   90.15%
    Req/Sec     6.22k     1.24k   33.14k    84.97%
  1981736 requests in 20.10s, 1.99GB read
Requests/sec:  98596.72
Transfer/sec:    101.36MB
--------------------------------------------------------
Running benchmark with 1 threads and 50 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   318.56us  299.06us   6.23ms   89.01%
    Req/Sec   112.04k    17.45k  170.41k    90.50%
  2229939 requests in 20.00s, 2.24GB read
Requests/sec: 111489.29
Transfer/sec:    114.62MB
--------------------------------------------------------
Running benchmark with 2 threads and 50 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   462.07us  424.68us  12.48ms   86.98%
    Req/Sec    48.86k     8.30k   87.58k    90.75%
  1943748 requests in 20.00s, 1.95GB read
Requests/sec:  97163.44
Transfer/sec:     99.89MB
--------------------------------------------------------
Running benchmark with 4 threads and 50 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   479.57us  440.29us   8.74ms   85.66%
    Req/Sec    24.13k     4.38k   45.47k    89.38%
  1920865 requests in 20.01s, 1.93GB read
Requests/sec:  96008.82
Transfer/sec:     98.70MB
--------------------------------------------------------
Running benchmark with 8 threads and 50 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   541.61us  527.21us  14.03ms   87.28%
    Req/Sec    11.64k     2.22k   23.38k    85.44%
  1854492 requests in 20.01s, 1.86GB read
Requests/sec:  92658.99
Transfer/sec:     95.26MB
--------------------------------------------------------
Running benchmark with 16 threads and 50 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   696.28us    0.89ms  25.92ms   90.18%
    Req/Sec     5.52k     1.48k   16.35k    80.72%
  1759971 requests in 20.03s, 1.77GB read
Requests/sec:  87871.33
Transfer/sec:     90.34MB
--------------------------------------------------------
Running benchmark with 1 threads and 100 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   699.97us  839.00us  18.84ms   91.20%
    Req/Sec   109.13k    17.11k  170.75k    90.00%
  2171475 requests in 20.00s, 2.18GB read
Requests/sec: 108551.71
Transfer/sec:    111.60MB
--------------------------------------------------------
Running benchmark with 2 threads and 100 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.90ms    0.89ms  20.90ms   88.19%
    Req/Sec    49.08k     8.40k   82.81k    91.25%
  1953628 requests in 20.01s, 1.96GB read
Requests/sec:  97655.13
Transfer/sec:    100.40MB
--------------------------------------------------------
Running benchmark with 4 threads and 100 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.99ms    1.00ms  17.87ms   88.37%
    Req/Sec    24.38k     4.51k   43.35k    88.25%
  1942100 requests in 20.01s, 1.95GB read
Requests/sec:  97033.79
Transfer/sec:     99.76MB
--------------------------------------------------------
Running benchmark with 8 threads and 100 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.04ms    1.09ms  26.23ms   88.94%
    Req/Sec    12.06k     2.37k   25.87k    84.38%
  1922675 requests in 20.03s, 1.93GB read
Requests/sec:  95981.70
Transfer/sec:     98.68MB
--------------------------------------------------------
Running benchmark with 16 threads and 100 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.37ms    2.06ms  65.05ms   91.99%
    Req/Sec     5.81k     1.51k   17.35k    76.34%
  1855449 requests in 20.08s, 1.86GB read
Requests/sec:  92410.84
Transfer/sec:     95.00MB
--------------------------------------------------------
Running benchmark with 1 threads and 150 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms    1.16ms  25.42ms   88.95%
    Req/Sec   108.09k    17.18k  170.22k    91.00%
  2150654 requests in 20.01s, 2.16GB read
Requests/sec: 107489.99
Transfer/sec:    110.51MB
--------------------------------------------------------
Running benchmark with 2 threads and 150 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34ms    1.28ms  20.82ms   86.22%
    Req/Sec    48.84k     8.32k   82.85k    90.75%
  1944675 requests in 20.02s, 1.95GB read
Requests/sec:  97155.73
Transfer/sec:     99.88MB
--------------------------------------------------------
Running benchmark with 4 threads and 150 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.44ms    1.43ms  29.29ms   87.13%
    Req/Sec    24.44k     4.60k   50.06k    87.62%
  1948139 requests in 20.03s, 1.96GB read
Requests/sec:  97251.06
Transfer/sec:     99.98MB
--------------------------------------------------------
Running benchmark with 8 threads and 150 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.47ms    1.46ms  30.78ms   86.66%
    Req/Sec    12.36k     2.50k   25.36k    83.06%
  1972085 requests in 20.06s, 1.98GB read
Requests/sec:  98331.98
Transfer/sec:    101.09MB
--------------------------------------------------------
Running benchmark with 16 threads and 150 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.79ms    1.85ms  33.10ms   84.73%
    Req/Sec     6.03k     1.61k   15.92k    73.98%
  1926449 requests in 20.09s, 1.93GB read
Requests/sec:  95890.26
Transfer/sec:     98.58MB
--------------------------------------------------------
Running benchmark with 1 threads and 200 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34ms    1.27ms  16.90ms   86.11%
    Req/Sec   106.68k    17.62k  165.59k    90.50%
  2123087 requests in 20.01s, 2.13GB read
Requests/sec: 106108.73
Transfer/sec:    109.09MB
--------------------------------------------------------
Running benchmark with 2 threads and 200 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.70ms    1.57ms  22.98ms   83.30%
    Req/Sec    49.60k     8.54k   87.09k    91.25%
  1975329 requests in 20.02s, 1.98GB read
Requests/sec:  98674.39
Transfer/sec:    101.44MB
--------------------------------------------------------
Running benchmark with 4 threads and 200 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.84ms    1.68ms  31.03ms   80.51%
    Req/Sec    24.65k     4.71k   46.11k    85.25%
  1965605 requests in 20.04s, 1.97GB read
Requests/sec:  98060.50
Transfer/sec:    100.81MB
--------------------------------------------------------
Running benchmark with 8 threads and 200 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.95ms    1.85ms  34.08ms   81.62%
    Req/Sec    12.54k     2.54k   26.20k    81.50%
  2002737 requests in 20.07s, 2.01GB read
Requests/sec:  99772.86
Transfer/sec:    102.57MB
--------------------------------------------------------
Running benchmark with 16 threads and 200 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.25ms    2.26ms  23.89ms   84.02%
    Req/Sec     6.19k     1.71k   16.05k    73.95%
  1973356 requests in 20.10s, 1.98GB read
Requests/sec:  98187.25
Transfer/sec:    100.94MB
--------------------------------------------------------
Running benchmark with 1 threads and 300 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.04ms    1.63ms  15.76ms   81.54%
    Req/Sec    97.34k     9.22k  142.07k    83.50%
  1941083 requests in 20.09s, 1.95GB read
Requests/sec:  96602.54
Transfer/sec:     99.31MB
--------------------------------------------------------
Running benchmark with 2 threads and 300 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.43ms    2.09ms  20.01ms   78.48%
    Req/Sec    49.62k     8.46k   86.98k    87.75%
  1979354 requests in 20.08s, 1.99GB read
Requests/sec:  98554.44
Transfer/sec:    101.32MB
--------------------------------------------------------
Running benchmark with 4 threads and 300 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.60ms    2.30ms  21.49ms   76.05%
    Req/Sec    24.97k     5.08k   47.06k    86.06%
  1984138 requests in 20.03s, 1.99GB read
Requests/sec:  99052.84
Transfer/sec:    101.83MB
--------------------------------------------------------
Running benchmark with 8 threads and 300 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.69ms    2.38ms  22.33ms   72.47%
    Req/Sec    12.62k     2.82k   31.55k    81.64%
  2012497 requests in 20.09s, 2.02GB read
Requests/sec: 100156.85
Transfer/sec:    102.97MB
--------------------------------------------------------
Running benchmark with 16 threads and 300 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.16ms    3.12ms  30.05ms   82.65%
    Req/Sec     6.33k     1.99k   23.98k    74.89%
  2018330 requests in 20.10s, 2.03GB read
Requests/sec: 100417.36
Transfer/sec:    103.24MB
--------------------------------------------------------
Running benchmark with 1 threads and 400 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.54ms    1.85ms  18.16ms   81.15%
    Req/Sec    98.48k    15.86k  153.47k    90.45%
  1957395 requests in 20.02s, 1.97GB read
Requests/sec:  97774.14
Transfer/sec:    100.52MB
--------------------------------------------------------
Running benchmark with 2 threads and 400 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.10ms    2.63ms  26.24ms   78.46%
    Req/Sec    49.85k     9.10k   89.85k    88.94%
  1981258 requests in 20.02s, 1.99GB read
Requests/sec:  98958.78
Transfer/sec:    101.74MB
--------------------------------------------------------
Running benchmark with 4 threads and 400 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.37ms    2.94ms  36.16ms   75.84%
    Req/Sec    25.00k     5.35k   54.94k    85.18%
  1989630 requests in 20.05s, 2.00GB read
Requests/sec:  99249.21
Transfer/sec:    102.03MB
--------------------------------------------------------
Running benchmark with 8 threads and 400 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.45ms    3.12ms  32.35ms   73.77%
    Req/Sec    12.85k     3.40k   38.69k    81.82%
  2046891 requests in 20.10s, 2.06GB read
Requests/sec: 101853.73
Transfer/sec:    104.71MB
--------------------------------------------------------
Running benchmark with 16 threads and 400 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.17ms    3.95ms  38.17ms   72.49%
    Req/Sec     6.40k     2.08k   23.93k    75.15%
  2041880 requests in 20.10s, 2.05GB read
Requests/sec: 101607.29
Transfer/sec:    104.46MB
--------------------------------------------------------
Running benchmark with 1 threads and 500 connections for 20s
Running 20s test @ http://localhost:9100
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.08ms    2.01ms  23.14ms   82.13%
    Req/Sec    96.95k    16.11k  153.81k    88.44%
  1936162 requests in 20.10s, 1.94GB read
Requests/sec:  96326.29
Transfer/sec:     99.03MB
--------------------------------------------------------
Running benchmark with 2 threads and 500 connections for 20s
Running 20s test @ http://localhost:9100
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.73ms    3.07ms  25.96ms   78.27%
    Req/Sec    50.31k     9.22k   92.43k    88.69%
  2000979 requests in 20.03s, 2.01GB read
Requests/sec:  99892.14
Transfer/sec:    102.70MB
--------------------------------------------------------
Running benchmark with 4 threads and 500 connections for 20s
Running 20s test @ http://localhost:9100
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.05ms    3.53ms  30.09ms   76.60%
    Req/Sec    25.31k     5.75k   52.88k    83.42%
  2018118 requests in 20.10s, 2.03GB read
Requests/sec: 100410.56
Transfer/sec:    103.23MB
--------------------------------------------------------
Running benchmark with 8 threads and 500 connections for 20s
Running 20s test @ http://localhost:9100
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.12ms    3.70ms  41.54ms   73.98%
    Req/Sec    12.99k     3.71k   67.56k    82.40%
  2067874 requests in 20.10s, 2.08GB read
Requests/sec: 102895.14
Transfer/sec:    105.78MB
--------------------------------------------------------
Running benchmark with 16 threads and 500 connections for 20s
Running 20s test @ http://localhost:9100
  16 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.95ms    4.59ms  56.65ms   71.30%
    Req/Sec     6.39k     2.09k   21.29k    77.26%
  2040254 requests in 20.09s, 2.05GB read
Requests/sec: 101566.63
Transfer/sec:    104.42MB
stderr:
number of connections must be >= threads
number of connections must be >= threads
number of connections must be >= threads
[...]